
#Configure the interface to the default router. 
#In this scenario you have a Layer 3 GigabitEthernet port.

Switch(config)#interface GigabitEthernet 0/1
Switch(config-if)#no switchport
Switch(config-if)#ip address 10.13.237.2 255.255.255.128
Switch(config-if)#no shutdown

# Create the VLAN 

Switch# configure terminal
# Enter configuration commands, one per line.  End with CNTL/Z.
switch(config)# vlan 10
switch(config-vlan)# name admin
switch(config-vlan)# no shutdown

# Assign the VLAN to an interface

Switch(config)#interface FastEthernet 0/10
Switch(config-if)#switchport access vlan 10
switch(config-if)# no shutdown

# Configure the VLAN interfaces with the IP address 

Switch#configure terminal
# Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface Vlan10
Switch(config-if)#ip address 10.2.237.17 255.255.255.248
Switch(config-if)#no shutdown
